# SQL Notes
### resource:https://www.w3schools.com/sql/default.asp

# select, *, count

In [ ]:
# use select to select column from tables, * means everything
select * from table_name

In [ ]:
#The SELECT DISTINCT statement is used to return only distinct (different) values.
#Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.
select distinct col_name from table_name

In [5]:
# The follwing sql count the distinct values in a col from a table
select count(distinct col_name) from table_name

# where,not,or,and

In [7]:
# Use where for condition select
# SELECT column1, column2, ...
# FROM table_name
# WHERE condition;
select * from Customers where Country='Mexico';

SELECT column1, column2, ...
FROM table_name
WHERE condition1 AND/OR/NOT condition2 AND/OR/NOT condition3 ...;

In [ ]:
SELECT * FROM Customers WHERE Country='Germany' AND City='Berlin';
SELECT * FROM Customers WHERE City='Berlin' OR City='München';
SELECT * FROM Customers WHERE NOT Country='Germany';

# order by, insert, null

SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;

In [ ]:
SELECT * FROM Customers ORDER BY Country;
SELECT * FROM Customers ORDER BY Country, CustomerName;
SELECT * FROM Customers ORDER BY Country DESC;
SELECT * FROM Customers ORDER BY Country ASC, CustomerName DESC;

Specify both the column names and the values to be inserted:

In [ ]:
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);

If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query. However, make sure the order of the values is in the same order as the columns in the table. Here, the INSERT INTO syntax would be as follows:

In [ ]:
INSERT INTO table_name VALUES (value1, value2, value3, ...);

In [ ]:
INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway');

It is not possible to test for NULL values with comparison operators, such as =, <, or <>.
We will have to use the IS NULL and IS NOT NULL operators instead.

In [ ]:
SELECT column_names
FROM table_name
WHERE column_name IS NULL;

In [ ]:
SELECT column_names
FROM table_name
WHERE column_name IS NOT NULL;

# update, delete

In [ ]:
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;

In [ ]:
UPDATE Customers
SET ContactName='Juan'
WHERE Country='Mexico';

In [ ]:
# the following update all the contactName to 'Juan'
UPDATE Customers
SET ContactName='Juan';

The DELETE statement is used to delete existing records in a table.
It is possible to delete all rows in a table without deleting the table. This means that the table structure, attributes, and indexes will be intact:

In [ ]:
DELETE FROM table_name;

Delete based on condition:

In [ ]:
DELETE FROM Customers WHERE CustomerName='Alfreds Futterkiste';

# Min, Max, Count, AVG,Sum

The MIN() function returns the smallest value of the selected column.

In [ ]:
SELECT MIN(column_name)
FROM table_name
WHERE condition;

The MAX() function returns the largest value of the selected column.

In [ ]:
SELECT MAX(column_name)
FROM table_name
WHERE condition;

In [ ]:
# The following SQL statement finds the price of the cheapest product:
SELECT MIN(Price) AS SmallestPrice
FROM Products;

In [ ]:
# The following SQL statement finds the price of the most expensive product:
SELECT MAX(Price) AS LargestPrice
FROM Products;

In [ ]:
# The COUNT() function returns the number of rows that matches a specified criterion.
SELECT COUNT(column_name)
FROM table_name
WHERE condition;

In [ ]:
# The AVG() function returns the average value of a numeric column. 
SELECT AVG(column_name)
FROM table_name
WHERE condition;

In [ ]:
# The SUM() function returns the total sum of a numeric column. 
SELECT SUM(column_name)
FROM table_name
WHERE condition;

In [ ]:
# The following SQL statement finds the number of products:
SELECT COUNT(ProductID)
FROM Products;

In [ ]:
# The following SQL statement finds the average price of all products:
SELECT AVG(Price)
FROM Products;

In [ ]:
# The following SQL statement finds the sum of the "Quantity" fields in the "OrderDetails" table:
SELECT SUM(Quantity)
FROM OrderDetails;

# Like

The SQL LIKE Operator
The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

There are two wildcards often used in conjunction with the LIKE operator:

 The percent sign (%) represents zero, one, or multiple characters
 The underscore sign (_) represents one, single character

In [ ]:
SELECT column1, column2, ...
FROM table_name
WHERE columnN LIKE pattern;

<img src="img/like.png">

# Wildcards

<img src='img/wildcards.png'>

# In

The IN operator allows you to specify multiple values in a WHERE clause.

The IN operator is a shorthand for multiple OR conditions.

In [ ]:
SELECT column_name(s)
FROM table_name
WHERE column_name IN (value1, value2, ...);

In [ ]:
SELECT column_name(s)
FROM table_name
WHERE column_name IN (SELECT STATEMENT);

In [ ]:
# The following SQL statement selects all customers that are located in "Germany", "France" or "UK":
SELECT * FROM Customers
WHERE Country IN ('Germany', 'France', 'UK');

In [ ]:
# The following SQL statement selects all customers that are NOT located in "Germany", "France" or "UK":
SELECT * FROM Customers
WHERE Country NOT IN ('Germany', 'France', 'UK');

In [ ]:
# The following SQL statement selects all customers that are from the same countries as the suppliers:
SELECT * FROM Customers
WHERE Country IN (SELECT Country FROM Suppliers);

# Between

The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates.

The BETWEEN operator is inclusive: begin and end values are included.

In [ ]:
SELECT column_name(s)
FROM table_name
WHERE column_name BETWEEN value1 AND value2;

In [ ]:
SELECT * FROM Products
WHERE Price BETWEEN 10 AND 20;

# Aliases
SQL aliases are used to give a table, or a column in a table, a temporary name.

Aliases are often used to make column names more readable.

An alias only exists for the duration of that query.

An alias is created with the AS keyword.

In [ ]:
SELECT column_name AS alias_name
FROM table_name;

In [ ]:
SELECT column_name(s)
FROM table_name AS alias_name;

In [ ]:
SELECT CustomerName, Address + ', ' + PostalCode + ' ' + City + ', ' + Country AS Address
FROM Customers;

<img src="img/as.png">

# Join（very important）

In [ ]:
SQL JOIN
A JOIN clause is used to combine rows from two or more tables, based on a related column between them.

Let's look at a selection from the "Orders" table:

<img src="img/order_customer.png">

In [ ]:
SELECT Orders.OrderID, Customers.CustomerName, Orders.OrderDate
FROM Orders
INNER JOIN Customers ON Orders.CustomerID=Customers.CustomerID;
# note here we want to inner join two tables,so we pick a table frist. We see "From Orders", and then we can inner Join Customers.
# Cutomers.CustomerName is just a component of the result table. But, "From Orders" will see orderID, OrderDate

<img src="img/inner_join_result.png">

<img src="img/sql_joins.png">

# Viedo Resource For the Join Concept(important!!!!! must watch!!!!!):

https://youtu.be/9yeOJ0ZMUYw<br>
https://youtu.be/Jh_pvk48jHA

# Union

The SQL UNION Operator
The UNION operator is used to combine the result-set of two or more SELECT statements.

Every SELECT statement within UNION must have the same number of columns
The columns must also have similar data types
The columns in every SELECT statement must also be in the same order
UNION Syntax

In [ ]:
SELECT column_name(s) FROM table1
UNION
SELECT column_name(s) FROM table2;

In [ ]:
# UNION ALL Syntax
# The UNION operator selects only distinct values by default. To allow duplicate values, use UNION ALL:
SELECT column_name(s) FROM table1
UNION ALL
SELECT column_name(s) FROM table2;

# Group by

The SQL GROUP BY Statement
The GROUP BY statement groups rows that have the same values into summary rows, like "find the number of customers in each country".

The GROUP BY statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country;

# The SQL HAVING Clause
The HAVING clause was added to SQL because the WHERE keyword cannot be used with aggregate functions.

In [ ]:
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
HAVING condition
ORDER BY column_name(s);

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
HAVING COUNT(CustomerID) > 5;

In [ ]:
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
HAVING COUNT(CustomerID) > 5
ORDER BY COUNT(CustomerID) DESC;

# HackerRank Sql Practics

Query all columns for all American cities in the CITY table with populations larger than 100000. The CountryCode for America is USA.

In [ ]:
select * from CITY where POPULATION > 100000 and CountryCode = 'USA'

Query the NAME field for all American cities in the CITY table with populations larger than 120000. The CountryCode for America is USA.

In [ ]:
select NAME from CITY where POPULATION > 120000 and CountryCode = 'USA'

Query all columns (attributes) for every row in the CITY table.

In [ ]:
select * from CITY

Query all columns for a city in CITY with the ID 1661.

In [ ]:
select * from CITY where ID = 1661

Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

In [ ]:
select * from CITY where COUNTRYCODE='JPN'

Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

In [ ]:
select NAME from CITY where COUNTRYCODE='JPN'

Query a list of CITY and STATE from the STATION table.
The STATION table is described as follows:

In [ ]:
select CITY,STATE from STATION

Query a list of CITY names from STATION for cities that have an even ID number. Print the results in any order, but exclude duplicates from the answer.
The STATION table is described as follows:

In [ ]:
select distinct city from station where mod(ID,2)=0

important：

Find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.
The STATION table is described as follows:

In [ ]:
select (count(CITY)- count(distinct CITY)) from STATION as difference

important：

Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

In [ ]:
select CITY, LENGTH(CITY) from STATION order by LENGTH(CITY) asc, CITY limit 1;
select CITY, LENGTH(CITY) from STATION order by LENGTH(CITY) DESC, CITY limit 1;

Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

In [ ]:
# ms SQL:
select distinct CITY from STATION where CITY like '[aeiou]%'
# my SQL:
select distinct CITY from STATION where substr(CITY,1,1) in ('a','e','i','o','u')

Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

In [ ]:
# ms SQL:
select distinct CITY from STATION where CITY like '%[aeiou]'
# my SQL:
select distinct CITY from STATION where substr(CITY,length(CITY),1) in ('a','e','i','o','u');

Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

In [ ]:
select distinct CITY from STATION where CITY like '[aeiou]%[aeiou]';

Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.

In [ ]:
select distinct CITY from STATION where CITY like '[^aeiou]%'
# mysql case:
select distinct CITY from STATION where not REGEXP_LIKE(CITY,'^[aeiouAEIOU]')

Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

In [ ]:
select distinct CITY from STATION where not REGEXP_LIKE(CITY,'[aeiouAEIOU]$')

Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT city FROM station WHERE city RLIKE '^[^aeiouAEIOU].*|.*[^AEIOUaeiou]$';
# * means 0 or more, . means any, so .* means any one character or more of any character
# a*:匹配一个或多个 a 字符的任何序列。